// ox game.cpp : このファイルには 'main' 関数が含まれています。プログラム実行の開始と終了がそこで行われます。
//

#include <iostream>

int main()
{
    std::cout << "Hello World!\n";

    //  テストコメント


}

/*

まず基礎になる親クラスを作る

タイトル画面
・ボタンで画面遷移
　１人プレイor２人プレイ
 　

難易度選択画面
・三択で各ゲームモード画面に遷移
　ボタン選択？

ゲーム画面
・右端にルール説明を描画
　（画像）
・中央に盤面を描画
   （盤面の見た目は画像）
   座標・判定は二次元配列で処理
　
・左側に持ち駒と現在の得点を描画
　（数字直書き）

リザルト画面
・結果の表示（どっちの勝ちか）
・リトライorタイトルに戻る　ボタン選択
・一定時間操作なしでタイトルへ戻る



プレイヤーの挙動（１P、２P）


*/




// プログラムの実行: Ctrl + F5 または [デバッグ] > [デバッグなしで開始] メニュー
// プログラムのデバッグ: F5 または [デバッグ] > [デバッグの開始] メニュー

// 作業を開始するためのヒント: 
//    1. ソリューション エクスプローラー ウィンドウを使用してファイルを追加/管理します 
//   2. チーム エクスプローラー ウィンドウを使用してソース管理に接続します
//   3. 出力ウィンドウを使用して、ビルド出力とその他のメッセージを表示します
//   4. エラー一覧ウィンドウを使用してエラーを表示します
//   5. [プロジェクト] > [新しい項目の追加] と移動して新しいコード ファイルを作成するか、[プロジェクト] > [既存の項目の追加] と移動して既存のコード ファイルをプロジェクトに追加します
//   6. 後ほどこのプロジェクトを再び開く場合、[ファイル] > [開く] > [プロジェクト] と移動して .sln ファイルを選択します
